Revit 2027 API
EnergyAnalysisMaterial.SpecificHeatCapacity Property
 The specific heat capacity of the material, in ft^2/(k*s^2).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SpecificHeatCapacity { get; }
Public ReadOnly Property SpecificHeatCapacity As Double
	Get
public:
property double SpecificHeatCapacity {
	double get ();
}
member SpecificHeatCapacity : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace